Cocoson23/NUC977/Code/Bare Machine/01-GPIOLED/Driver/Source/rtc.c
/**************************************************************************//**
* @file     RTC.c
* @version  V1.00
* $Revision: 1 $
* $Date: 15/05/29 10:48a $
* @brief    NUC970 RTC driver source file
*
* @note
* Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "nuc970.h"
#include "sys.h"
#include "RTC.h"

/** @addtogroup NUC970_Device_Driver NUC970 Device Driver
  @{
*/

/** @addtogroup NUC970_RTC_Driver RTC Driver
  @{
*/

/** @addtogroup NUC970_RTC_EXPORTED_FUNCTIONS RTC Exported Functions
  @{
*/

/// @cond HIDDEN_SYMBOLS

static PFN_RTC_CALLBACK  *g_pfnRTCCallBack_Tick    = NULL, *g_pfnRTCCallBack_Alarm   = NULL, *g_pfnRTCCallBack_PSWI   = NULL, *g_pfnRTCCallBack_Relative_Alarm =NULL;

static UINT32 volatile g_u32RTC_Count  = 0;
static CHAR g_chHourMode = 0;
static BOOL volatile g_bIsEnableTickInt  = FALSE;
static BOOL volatile g_bIsEnableAlarmInt = FALSE;

static UINT32 volatile g_u32Reg, g_u32Reg1,g_u32hiYear,g_u32loYear,g_u32hiMonth,g_u32loMonth,g_u32hiDay,g_u32loDay;
static UINT32 volatile g_u32hiHour,g_u32loHour,g_u32hiMin,g_u32loMin,g_u32hiSec,g_u32loSec;
UINT32 volatile i, Wait;

VOID RTC_Check(void)
{
    i =0;

    Wait = inp32(REG_RTC_INTSTS) & RTC_INTSTS_REGWRBUSY_Msk;

    while(Wait == RTC_INTSTS_REGWRBUSY_Msk) {

        Wait = inp32(REG_RTC_INTSTS) & RTC_INTSTS_REGWRBUSY_Msk;

        i++;

        if(i > RTC_WAIT_COUNT) {
            //sysprintf("Time out\n");
            break;
        }
    }
}

static void RTC_ISR (void)
{
    UINT32 volatile u32RegINTSTS;

    u32RegINTSTS = inp32(REG_RTC_INTSTS);

    if (u32RegINTSTS & RTC_TICK_INT) {                                   /* tick interrupt occurred */
        RTC_WriteEnable(1);
        outp32(REG_RTC_INTSTS, RTC_TICK_INT);
        RTC_Check();

        g_u32RTC_Count++;                                              /* maintain RTC tick count */

        if (g_pfnRTCCallBack_Tick != NULL) {                           /* execute tick callback function */
            g_pfnRTCCallBack_Tick();
        }

    }
    if (u32RegINTSTS & RTC_ALARM_INT) {                                  /* absolute alarm interrupt occurred */
        RTC_WriteEnable(1);
        outp32(REG_RTC_INTSTS, RTC_ALARM_INT);
        RTC_Check();

        if (g_pfnRTCCallBack_Alarm != NULL) {                           /* execute absolute alarm callback function */
            g_pfnRTCCallBack_Alarm();
        }
    }
    if (u32RegINTSTS & RTC_RELATIVE_ALARM_INT) {                          /* relative alarm interrupt occurred */
        RTC_WriteEnable(1);
        outp32(REG_RTC_INTSTS, RTC_RELATIVE_ALARM_INT);
        RTC_Check();

        RTC_Ioctl(0,RTC_IOC_DISABLE_INT,RTC_RELATIVE_ALARM_INT,0);

        if (g_pfnRTCCallBack_Relative_Alarm != NULL) {                  /* execute relative alarm callback function */
            g_pfnRTCCallBack_Relative_Alarm();
            g_pfnRTCCallBack_Relative_Alarm = NULL;
        }

    }
    if (u32RegINTSTS & RTC_PSWI_INT) {                                      /* power key interrupt occurred */
        RTC_WriteEnable(1);
        outp32(REG_RTC_INTSTS, RTC_PSWI_INT);
        RTC_Check();

        //RTC_Ioctl(0,RTC_IOC_DISABLE_INT,RTC_PSWI_INT,0);

        if (g_pfnRTCCallBack_PSWI != NULL) {                            /* execute power key callback function */
            g_pfnRTCCallBack_PSWI();
        }
    }

}
/// @endcond HIDDEN_SYMBOLS

/**
  * @brief      Set 32k Frequency Compensation Data
  *
  * @param[in]  i32FrequencyX100    Specify the RTC clock X100, ex: 3277365 means 32773.65.
  *
  * @return     E_RTC_ERR_FCR_VALUE   Wrong Compenation VALUE
  *             E_RTC_SUCCESS         Success
  *
  * @details    This API is used to compensate the 32 kHz frequency by current LXT frequency for RTC application.
  */
UINT32 RTC_DoFrequencyCompensation(INT32 i32FrequencyX100)
{
    INT32 i32RegInt, i32RegFra;
    UINT32 u32Reg;

    /* Compute integer and fraction for RTC FCR register */
    i32RegInt = (i32FrequencyX100 / 100) - RTC_FCR_REFERENCE;
    i32RegFra = (((i32FrequencyX100 % 100)) * 60) / 100;

    /* Judge Integer part is reasonable */
    if((i32RegInt < 0) | (i32RegInt > 15)) {
        return E_RTC_ERR_FCR_VALUE;
    }

    u32Reg = (uint32_t)((i32RegInt << 8) | i32RegFra);

    RTC_WriteEnable(1);
    outp32(REG_RTC_FREQADJ, u32Reg);
    RTC_Check();

    return E_RTC_SUCCESS;
}

/**
  * @brief      RTC access register enable
  *
  * @param[in]  bEnable    1: Enable access register
  *                        0: Disable access register
  *
  * @return     E_RTC_ERR_EIO   Time-out error
  *             E_RTC_SUCCESS   Success
  *
  */
UINT32 RTC_WriteEnable (BOOL bEnable)
{
    INT32 volatile i32i;

    RTC_Check();

    if(bEnable) {
        outp32(REG_RTC_RWEN, RTC_WRITE_KEY);
        RTC_Check();

        for (i32i = 0 ; i32i < RTC_WAIT_COUNT ; i32i++) {
            /*-------------------------------------------------------------------------------------------------*/
            /* check RTC_RWEN[16] to find out RTC write enable                                                  */
            /*-------------------------------------------------------------------------------------------------*/
            if ( inp32(REG_RTC_RWEN) & 0x10000) {
                break;
            }
        }

        if (i32i == RTC_WAIT_COUNT) {
            //sysprintf ("\nRTC: 3, set write enable FAILED!\n");

            return E_RTC_ERR_EIO;
        }
    } else {
        for (i32i = 0 ; i32i < RTC_WAIT_COUNT ; i32i++) {
            if ( inp32(REG_RTC_RWEN) == 0) {
                break;
            }
        }
    }

    return E_RTC_SUCCESS;
}

/**
  * @brief      Initial RTC and install ISR
  *
  * @param      None
  *
  * @return     E_RTC_ERR_EIO   Initial RTC time-out
  *             E_RTC_SUCCESS   Success
  *
  */
UINT32 RTC_Init (void)
{
    INT32 i32i;

