Cocoson23/NUC977/Code/Bare Machine/01-GPIOLED/Driver/Source/rtc.c
    /*-----------------------------------------------------------------------------------------------------*/
    /* Initial time data struct and some parameters.                                                       */
    /*-----------------------------------------------------------------------------------------------------*/
    g_pfnRTCCallBack_Alarm = NULL;
    g_pfnRTCCallBack_Tick = NULL;
    g_pfnRTCCallBack_PSWI = NULL;
    g_pfnRTCCallBack_Relative_Alarm = NULL;
    g_u32RTC_Count = 0;
    /*-----------------------------------------------------------------------------------------------------*/
    /* When RTC is power on, write 0xa5eb1357 to RTC_INIR to reset all logic.                              */
    /*-----------------------------------------------------------------------------------------------------*/

    outp32(REG_RTC_INIT, RTC_INIT_KEY);
    RTC_Check();

    for (i32i = 0 ; i32i < RTC_WAIT_COUNT ; i32i++) {
        if ( inp32(REG_RTC_INIT) & 0x01 ) {
            /* Check RTC_INIR[0] to find out RTC reset signal */
            break;
        }
    }

    if (i32i == RTC_WAIT_COUNT) {
        return E_RTC_ERR_EIO;
    }

    /*-----------------------------------------------------------------------------------------------------*/
    /* Install RTC ISR                                                                                     */
    /*-----------------------------------------------------------------------------------------------------*/

    outp32(REG_RTC_RWEN, RTC_WRITE_KEY);
    RTC_Check();

    for (i32i = 0 ; i32i < RTC_WAIT_COUNT ; i32i++) {
        /*-------------------------------------------------------------------------------------------------*/
        /* check RTC_RWEN[16] to find out RTC write enable                                                  */
        /*-------------------------------------------------------------------------------------------------*/
        if ( inp32(REG_RTC_RWEN) & 0x10000) {
            break;
        }
    }

    if (i32i == RTC_WAIT_COUNT) {
        return E_RTC_ERR_EIO;
    }

    sysInstallISR(IRQ_LEVEL_1, RTC_IRQn, (PVOID)RTC_ISR);
    sysSetLocalInterrupt(ENABLE_IRQ);
    sysEnableInterrupt(RTC_IRQn);

    return E_RTC_SUCCESS;
}


/**
  * @brief      Set Current Timer
  *
  * @param[in]  *sPt\n
  *                     Specify the time property and current time. It includes: \n
  *                     u8cClockDisplay: \ref RTC_CLOCK_12 / \ref RTC_CLOCK_24   \n
  *                     u8cAmPm: \ref RTC_AM / \ref RTC_PM                       \n
  *                     u32cSecond: Second value                                 \n
  *                     u32cMinute: Minute value                                 \n
  *                     u32cHour: Hour value                                     \n
  *                     u32cDayOfWeek: Day of week                               \n
  *                     u32cDay: Day value                                       \n
  *                     u32cMonth: Month value                                   \n
  *                     u32Year: Year value                                      \n
  *                     u32AlarmMaskSecond: Mask second alarm                    \n
  *                     u32AlarmMaskMinute: Mask minute alarm                    \n
  *                     u32AlarmMaskHour: Mask hour alarm                        \n
  *                     *pfnAlarmCallBack: Call back function                    \n
  *
  * @return     E_RTC_ERR_EIO   Initial RTC time-out
  *             E_RTC_SUCCESS   Success
  *
  */
UINT32 RTC_Open (RTC_TIME_DATA_T *sPt)
{
    UINT32 volatile u32Reg;

    /*-----------------------------------------------------------------------------------------------------*/
    /* DO BASIC JUDGEMENT TO Check RTC time data value is reasonable or not.                               */
    /*-----------------------------------------------------------------------------------------------------*/
    if ( ((sPt->u32Year - RTC_YEAR2000) > 99)|
            ((sPt->u32cMonth == 0) || (sPt->u32cMonth > 12))|
            ((sPt->u32cDay   == 0) || (sPt->u32cDay   > 31))) {
        return E_RTC_ERR_CALENDAR_VALUE;
    }

    if (sPt->u8cClockDisplay == RTC_CLOCK_12) {
        if ( (sPt->u32cHour == 0) || (sPt->u32cHour > 12) ) {
            return E_RTC_ERR_TIMESACLE_VALUE ;
        }
    } else if (sPt->u8cClockDisplay == RTC_CLOCK_24) {
        if (sPt->u32cHour > 23) {
            return E_RTC_ERR_TIMESACLE_VALUE ;
        }
    } else {
        return E_RTC_ERR_TIMESACLE_VALUE ;
    }

    if ((sPt->u32cMinute > 59) |
            (sPt->u32cSecond > 59) |
            (sPt->u32cSecond > 59)) {
        return E_RTC_ERR_TIME_VALUE ;
    }
    if (sPt->u32cDayOfWeek > 6) {
        return E_RTC_ERR_DWR_VALUE ;
    }

    /*-----------------------------------------------------------------------------------------------------*/
    /* Second, set RTC time data.                                                                          */
    /*-----------------------------------------------------------------------------------------------------*/
    if (sPt->u8cClockDisplay == RTC_CLOCK_12) {
        g_chHourMode = RTC_CLOCK_12;

        RTC_WriteEnable(1);
        outp32(REG_RTC_TIMEFMT, RTC_CLOCK_12);
        RTC_Check();

        /*-------------------------------------------------------------------------------------------------*/
        /* important, range of 12-hour PM mode is 21 upto 32                                               */
        /*-------------------------------------------------------------------------------------------------*/
        if (sPt->u8cAmPm == RTC_PM)
            sPt->u32cHour += 20;
    } else {                                                                           /* RTC_CLOCK_24 */
        g_chHourMode = RTC_CLOCK_24;

        RTC_WriteEnable(1);
        outp32(REG_RTC_TIMEFMT, RTC_CLOCK_24);
        RTC_Check();
    }


    g_u32hiHour  = sPt->u32cHour / 10;
    g_u32loHour  = sPt->u32cHour % 10;
    g_u32hiMin   = sPt->u32cMinute / 10;
    g_u32loMin   = sPt->u32cMinute % 10;
    g_u32hiSec   = sPt->u32cSecond / 10;
    g_u32loSec   = sPt->u32cSecond % 10;
    u32Reg     = (g_u32hiHour << 20);
    u32Reg    |= (g_u32loHour << 16);
    u32Reg    |= (g_u32hiMin << 12);
    u32Reg    |= (g_u32loMin << 8);
    u32Reg    |= (g_u32hiSec << 4);
    u32Reg    |= g_u32loSec;
    g_u32Reg = u32Reg;

    RTC_WriteEnable(1);
    outp32(REG_RTC_TIME, (UINT32)g_u32Reg);
    RTC_Check();

    if (sPt->u8cClockDisplay == RTC_CLOCK_12) {
        if (sPt->u8cAmPm == RTC_PM)
            sPt->u32cHour -= 20;
    }

    g_u32hiYear  = (sPt->u32Year - RTC_YEAR2000) / 10;
    g_u32loYear  = (sPt->u32Year - RTC_YEAR2000) % 10;
    g_u32hiMonth =  sPt->u32cMonth              / 10;
    g_u32loMonth =  sPt->u32cMonth              % 10;
    g_u32hiDay   =  sPt->u32cDay                / 10;
    g_u32loDay   =  sPt->u32cDay                % 10;
    u32Reg    = (g_u32hiYear << 20);
    u32Reg    |= (g_u32loYear << 16);
    u32Reg    |= (g_u32hiMonth << 12);
    u32Reg    |= (g_u32loMonth << 8);
    u32Reg    |= (g_u32hiDay << 4);
    u32Reg    |= g_u32loDay;
    g_u32Reg = u32Reg;

    RTC_WriteEnable(1);
    outp32 (REG_RTC_CAL, (UINT32)g_u32Reg);
    RTC_Check();

    RTC_WriteEnable(1);
    outp32(REG_RTC_WEEKDAY, (UINT32)sPt->u32cDayOfWeek);
    RTC_Check();

    return E_RTC_SUCCESS;
}


/**
  * @brief      Read current date/time or alarm date/time from RTC
  *
  * @param[in]   eTime  \ref RTC_CURRENT_TIME / \ref RTC_ALARM_TIME
  * @param[out]  *sPt\n
  *                     Specify the time property and current time. It includes: \n
  *                     u8cClockDisplay: \ref RTC_CLOCK_12 / \ref RTC_CLOCK_24   \n
  *                     u8cAmPm: \ref RTC_AM / \ref RTC_PM                       \n
  *                     u32cSecond: Second value                                 \n
  *                     u32cMinute: Minute value                                 \n
  *                     u32cHour: Hour value                                     \n
  *                     u32cDayOfWeek: Day of week                               \n
  *                     u32cDay: Day value                                       \n
  *                     u32cMonth: Month value                                   \n
  *                     u32Year: Year value                                      \n
  *                     u32AlarmMaskSecond: Mask second alarm                    \n
  *                     u32AlarmMaskMinute: Mask minute alarm                    \n
  *                     u32AlarmMaskHour: Mask hour alarm                        \n
  *                     *pfnAlarmCallBack: Call back function                    \n
  *
  * @return     E_RTC_ERR_ENOTTY   Wrong select time
  *             E_RTC_SUCCESS   Success
  *
  */
UINT32 RTC_Read (E_RTC_TIME_SELECT eTime, RTC_TIME_DATA_T *sPt)
{
    UINT32 u32Tmp;

    sPt->u8cClockDisplay = inp32(REG_RTC_TIMEFMT);                               /* 12/24-hour */
    sPt->u32cDayOfWeek = inp32(REG_RTC_WEEKDAY);                                  /* Day of week */

