Cocoson23/NUC977/Code/Bare Machine/01-GPIOLED/Driver/Source/rtc.c
    switch (eTime) {
    case RTC_CURRENT_TIME: {
        g_u32Reg   = inp32(REG_RTC_CAL);
        g_u32Reg1  = inp32(REG_RTC_TIME);
        break;
    }
    case RTC_ALARM_TIME: {
        g_u32Reg   = inp32(REG_RTC_CALM);
        g_u32Reg1  = inp32(REG_RTC_TALM);
        break;
    }
    default: {
        return E_RTC_ERR_ENOTTY;
    }
    }

    g_u32hiYear  = (g_u32Reg & 0xF00000) >> 20;
    g_u32loYear  = (g_u32Reg & 0xF0000) >> 16;
    g_u32hiMonth = (g_u32Reg & 0x1000) >> 12;
    g_u32loMonth = (g_u32Reg & 0xF00) >> 8;
    g_u32hiDay   = (g_u32Reg & 0x30) >> 4;
    g_u32loDay   =  g_u32Reg & 0xF;

    u32Tmp = (g_u32hiYear * 10);
    u32Tmp+= g_u32loYear;
    sPt->u32Year   =   u32Tmp  + RTC_YEAR2000;

    u32Tmp = (g_u32hiMonth * 10);
    sPt->u32cMonth = u32Tmp + g_u32loMonth;

    u32Tmp = (g_u32hiDay * 10);
    sPt->u32cDay   =  u32Tmp  + g_u32loDay;

    g_u32hiHour = (g_u32Reg1 & 0x300000) >> 20;
    g_u32loHour = (g_u32Reg1 & 0xF0000) >> 16;
    g_u32hiMin  = (g_u32Reg1 & 0x7000) >> 12;
    g_u32loMin  = (g_u32Reg1 & 0xF00) >> 8;
    g_u32hiSec  = (g_u32Reg1 & 0x70) >> 4;
    g_u32loSec  =  g_u32Reg1 & 0xF;

    if (sPt->u8cClockDisplay == RTC_CLOCK_12) {
        u32Tmp = (g_u32hiHour * 10);
        u32Tmp+= g_u32loHour;
        sPt->u32cHour = u32Tmp;                                /* AM: 1~12. PM: 21~32. */

        if(eTime ==RTC_CURRENT_TIME) {
            if (sPt->u32cHour >= 21) {
                sPt->u8cAmPm = RTC_PM;
                sPt->u32cHour -= 20;
            } else {
                sPt->u8cAmPm = RTC_AM;
            }
        } else {
            if (sPt->u32cHour < 12) {
                if(sPt->u32cHour == 0)
                    sPt->u32cHour = 12;
                sPt->u8cAmPm = RTC_AM;
            } else {
                sPt->u32cHour -= 12;
                sPt->u8cAmPm = RTC_PM;
            }
        }

        u32Tmp = (g_u32hiMin  * 10);
        u32Tmp+= g_u32loMin;
        sPt->u32cMinute = u32Tmp;

        u32Tmp = (g_u32hiSec  * 10);
        u32Tmp+= g_u32loSec;
        sPt->u32cSecond = u32Tmp;

    } else {
        /* RTC_CLOCK_24 */
        u32Tmp = (g_u32hiHour * 10);
        u32Tmp+= g_u32loHour;
        sPt->u32cHour   = u32Tmp;

        u32Tmp = (g_u32hiMin  * 10);
        u32Tmp+= g_u32loMin;
        sPt->u32cMinute = u32Tmp;

        u32Tmp = (g_u32hiSec  * 10);
        u32Tmp+= g_u32loSec;
        sPt->u32cSecond = u32Tmp;
    }

    return E_RTC_SUCCESS;

}


/**
  * @brief      Write current date/time or alarm date/time from RTC
  *
  * @param[in]   eTime  \ref RTC_CURRENT_TIME / \ref RTC_ALARM_TIME
  * @param[in]  *sPt\n
  *                     Specify the time property and current time. It includes: \n
  *                     u8cClockDisplay: \ref RTC_CLOCK_12 / \ref RTC_CLOCK_24   \n
  *                     u8cAmPm: \ref RTC_AM / \ref RTC_PM                       \n
  *                     u32cSecond: Second value                                 \n
  *                     u32cMinute: Minute value                                 \n
  *                     u32cHour: Hour value                                     \n
  *                     u32cDayOfWeek: Day of week                               \n
  *                     u32cDay: Day value                                       \n
  *                     u32cMonth: Month value                                   \n
  *                     u32Year: Year value                                      \n
  *                     u32AlarmMaskSecond: Mask second alarm                    \n
  *                     u32AlarmMaskMinute: Mask minute alarm                    \n
  *                     u32AlarmMaskHour: Mask hour alarm                        \n
  *                     *pfnAlarmCallBack: Call back function                    \n
  *
  * @return     E_RTC_ERR_ENOTTY            Wrong select time
  *             E_RTC_ERR_CALENDAR_VALUE    Wrong calender value
  *             E_RTC_ERR_TIME_VALUE        Wrong time value
  *             E_RTC_ERR_DWR_VALUE         Wrong day of week value
  *             E_RTC_SUCCESS               Success
  *
  */
UINT32 RTC_Write(E_RTC_TIME_SELECT eTime, RTC_TIME_DATA_T *sPt)
{
    UINT32 u32Reg;

    /*-----------------------------------------------------------------------------------------------------*/
    /* Check RTC time data value is reasonable or not.                                                     */
    /*-----------------------------------------------------------------------------------------------------*/
    if ( ((sPt->u32Year - RTC_YEAR2000) > 99)|
            ((sPt->u32cMonth == 0) || (sPt->u32cMonth > 12))|
            ((sPt->u32cDay   == 0) || (sPt->u32cDay   > 31))) {
        return E_RTC_ERR_CALENDAR_VALUE;
    }

    if ( (sPt->u32Year - RTC_YEAR2000) > 99 ) {
        return E_RTC_ERR_CALENDAR_VALUE;
    }

    if ( (sPt->u32cMonth == 0) || (sPt->u32cMonth > 12) ) {
        return E_RTC_ERR_CALENDAR_VALUE;
    }

    if ( (sPt->u32cDay == 0) || (sPt->u32cDay > 31) ) {
        return E_RTC_ERR_CALENDAR_VALUE;
    }

    if (sPt->u8cClockDisplay == RTC_CLOCK_12) {
        if ( (sPt->u32cHour == 0) || (sPt->u32cHour > 12) ) {
            return E_RTC_ERR_TIME_VALUE;
        }
    } else if (sPt->u8cClockDisplay == RTC_CLOCK_24) {
        if (sPt->u32cHour > 23) {
            return E_RTC_ERR_TIME_VALUE;
        }
    } else {
        return E_RTC_ERR_TIME_VALUE;
    }

    if (sPt->u32cMinute > 59) {
        return E_RTC_ERR_TIME_VALUE;
    }

    if (sPt->u32cSecond > 59) {
        return E_RTC_ERR_TIME_VALUE;
    }

    if (sPt->u32cDayOfWeek > 6) {
        return E_RTC_ERR_DWR_VALUE;
    }

    switch (eTime) {

    case RTC_CURRENT_TIME: {
        /*---------------------------------------------------------------------------------------------*/
        /* Second, set RTC time data.                                                                  */
        /*---------------------------------------------------------------------------------------------*/

        if (sPt->u8cClockDisplay == RTC_CLOCK_12) {
            g_chHourMode = RTC_CLOCK_12;

            RTC_WriteEnable(1);
            outp32(REG_RTC_TIMEFMT, RTC_CLOCK_12);
            RTC_Check();

            /*-----------------------------------------------------------------------------------------*/
            /* important, range of 12-hour PM mode is 21 upto 32                                       */
            /*-----------------------------------------------------------------------------------------*/
            if (sPt->u8cAmPm == RTC_PM) {
                sPt->u32cHour += 20;
            }
        } else {                                                              /* RTC_CLOCK_24 */
            g_chHourMode = RTC_CLOCK_24;

            RTC_WriteEnable(1);
            outp32(REG_RTC_TIMEFMT, RTC_CLOCK_24);
            RTC_Check();

