Cocoson23/NUC977/Code/Bare Machine/01-GPIOLED/Driver/Source/rtc.c
        }

        g_u32hiHour  = sPt->u32cHour / 10;
        g_u32loHour  = sPt->u32cHour % 10;
        g_u32hiMin   = sPt->u32cMinute / 10;
        g_u32loMin   = sPt->u32cMinute % 10;
        g_u32hiSec   = sPt->u32cSecond / 10;
        g_u32loSec   = sPt->u32cSecond % 10;

        u32Reg = (g_u32hiHour << 20);
        u32Reg|= (g_u32loHour << 16);
        u32Reg|= (g_u32hiMin << 12);
        u32Reg|= (g_u32loMin << 8);
        u32Reg|= (g_u32hiSec << 4);
        u32Reg|= g_u32loSec;
        g_u32Reg = u32Reg;

        RTC_WriteEnable(1);
        outp32(REG_RTC_TIME, (UINT32)g_u32Reg);
        RTC_Check();

        g_u32hiYear  = (sPt->u32Year - RTC_YEAR2000) / 10;
        g_u32loYear  = (sPt->u32Year - RTC_YEAR2000) % 10;
        g_u32hiMonth = sPt->u32cMonth / 10;
        g_u32loMonth = sPt->u32cMonth % 10;
        g_u32hiDay   = sPt->u32cDay / 10;
        g_u32loDay   = sPt->u32cDay % 10;

        u32Reg = (g_u32hiYear << 20);
        u32Reg|= (g_u32loYear << 16);
        u32Reg|= (g_u32hiMonth << 12);
        u32Reg|= (g_u32loMonth << 8);
        u32Reg|= (g_u32hiDay << 4);
        u32Reg|= g_u32loDay;
        g_u32Reg = u32Reg;

        RTC_WriteEnable(1);
        outp32 (REG_RTC_CAL, (UINT32)g_u32Reg);
        RTC_Check();

        RTC_WriteEnable(1);
        outp32(REG_RTC_WEEKDAY,(UINT32) sPt->u32cDayOfWeek);
        RTC_Check();

        if (sPt->u8cClockDisplay == RTC_CLOCK_12) {
            if (sPt->u8cAmPm == RTC_PM) {
                sPt->u32cHour -= 20;
            }
        }

        return E_RTC_SUCCESS;

    }
    case RTC_ALARM_TIME: {
        RTC_WriteEnable(1);
        outp32(REG_RTC_PWRCTL,inp32(REG_RTC_PWRCTL) & ~RTC_PWRCTL_ALARM_EN_Msk);
        RTC_Check();

        g_pfnRTCCallBack_Alarm = NULL;                                         /* Initial call back function.*/
        /*---------------------------------------------------------------------------------------------*/
        /* Second, set alarm time data.                                                                */
        /*---------------------------------------------------------------------------------------------*/
        g_u32hiYear = (sPt->u32Year - RTC_YEAR2000) / 10;
        g_u32loYear = (sPt->u32Year - RTC_YEAR2000) % 10;
        g_u32hiMonth = sPt->u32cMonth / 10;
        g_u32loMonth = sPt->u32cMonth % 10;
        g_u32hiDay = sPt->u32cDay / 10;
        g_u32loDay = sPt->u32cDay % 10;

        //u32Reg = ((sPt->u32AlarmMaskDayOfWeek & 0x1) << 31);
        u32Reg = ((sPt->u32cDayOfWeek & 0x7) << 24);
        //u32Reg|= ((sPt->u32AlarmMaskYear & 0x1) << 30);
        u32Reg|= (g_u32hiYear << 20);
        u32Reg|= (g_u32loYear << 16);
        //u32Reg|= ((sPt->u32AlarmMaskMonth & 0x1) << 29);
        u32Reg|= (g_u32hiMonth << 12);
        u32Reg|= (g_u32loMonth << 8);
        //u32Reg|= ((sPt->u32AlarmMaskDay & 0x1) << 28);
        u32Reg|= (g_u32hiDay << 4);
        u32Reg|= g_u32loDay;

        g_u32Reg = u32Reg;

        RTC_WriteEnable(1);
        outp32(REG_RTC_CALM, (UINT32)g_u32Reg);
        RTC_Check();


        if (g_chHourMode == RTC_CLOCK_12) {
            if (sPt->u8cAmPm == RTC_PM) {     /* important, range of 12-hour PM mode is 21 upto 32 */
                sPt->u32cHour += 20;
            }
        }
        g_u32hiHour   = sPt->u32cHour / 10;
        g_u32loHour   = sPt->u32cHour % 10;
        g_u32hiMin  = sPt->u32cMinute / 10;
        g_u32loMin  = sPt->u32cMinute % 10;
        g_u32hiSec  = sPt->u32cSecond / 10;
        g_u32loSec  = sPt->u32cSecond % 10;

        u32Reg = ((sPt->u32AlarmMaskHour & 0x1) << 30);
        u32Reg|= (g_u32hiHour << 20);
        u32Reg|= (g_u32loHour << 16);
        u32Reg|= ((sPt->u32AlarmMaskMinute & 0x1) << 29);
        u32Reg|= (g_u32hiMin << 12);
        u32Reg|= (g_u32loMin << 8);
        u32Reg|= ((sPt->u32AlarmMaskSecond & 0x1) << 28);
        u32Reg|= (g_u32hiSec << 4);
        u32Reg|= g_u32loSec;

        g_u32Reg = u32Reg;

        RTC_WriteEnable(1);
        outp32(REG_RTC_TALM, (UINT32)g_u32Reg);
        RTC_Check();

        if (sPt->u8cClockDisplay == RTC_CLOCK_12) {
            if (sPt->u8cAmPm == RTC_PM) {
                sPt->u32cHour -= 20;
            }
        }
        /*---------------------------------------------------------------------------------------------*/
        /* Third, install alarm callback function.                                                     */
        /*---------------------------------------------------------------------------------------------*/
        if (sPt->pfnAlarmCallBack != NULL) {
            g_pfnRTCCallBack_Alarm = sPt->pfnAlarmCallBack;
        }
        /*---------------------------------------------------------------------------------------------*/
        /* Finally, enable alarm interrupt.                                                            */
        /*---------------------------------------------------------------------------------------------*/

        RTC_Ioctl(0,RTC_IOC_ENABLE_INT,RTC_ALARM_INT,0);

        RTC_WriteEnable(1);
        outp32(REG_RTC_PWRCTL,inp32(REG_RTC_PWRCTL) | RTC_PWRCTL_ALARM_EN_Msk);
        RTC_Check();

        return E_RTC_SUCCESS;
    }
    default: {
        return E_RTC_ERR_ENOTTY;
    }
    }

}


/**
  * @brief      Support some commands for application.
  *
  * @param[in]   i32Num     Interface number.   always set 0
  * @param[in]   eCmd       Command
  * @param[in]   u32Arg0    Arguments for the command
  * @param[in]   u32Arg1    Arguments for the command.
  *
  * @return     E_RTC_ERR_ENOTTY            Wrong command or argument
  *             E_RTC_ERR_ENODEV            Interface number incorrect
  *             E_RTC_SUCCESS               Success
  *
  */
UINT32 RTC_Ioctl (INT32 i32Num, E_RTC_CMD eCmd, UINT32 u32Arg0, UINT32 u32Arg1)
{
    INT32 i32Ret;
    UINT32 u32Reg;
    RTC_TICK_T *ptick;
    UINT32 u32Tmp;

    if (i32Num != 0)
        return E_RTC_ERR_ENODEV;

    switch (eCmd) {

    case RTC_IOC_IDENTIFY_LEAP_YEAR: {
        u32Reg = inp32(REG_RTC_LEAPYEAR);
        if (u32Reg & 0x01) {
            *(PUINT32)u32Arg0 = RTC_LEAP_YEAR;
        } else {
            *(PUINT32)u32Arg0 = 0;
        }
        break;
    }
    case RTC_IOC_SET_TICK_MODE: {
        ptick = (RTC_TICK_T *) u32Arg0;

        if (g_bIsEnableTickInt== TRUE) {
            RTC_Ioctl(0,RTC_IOC_DISABLE_INT,RTC_TICK_INT,0);
            g_bIsEnableTickInt = TRUE;
        }
        g_u32RTC_Count = 0;

        if (ptick->ucMode > RTC_TICK_1_128_SEC) {                          /*Tick mode 0 to 7 */
            return E_RTC_ERR_ENOTTY ;
        }

        RTC_WriteEnable(1);
        outp32(REG_RTC_TICK, ptick->ucMode);
        RTC_Check();

        if (ptick->pfnTickCallBack != NULL) {
            g_pfnRTCCallBack_Tick = ptick->pfnTickCallBack;
        } else {
            g_pfnRTCCallBack_Tick = NULL;
        }
        /*---------------------------------------------------------------------------------------------*/
        /* Reset tick interrupt status if program enable tick interrupt before.                        */
        /*---------------------------------------------------------------------------------------------*/
        if (g_bIsEnableTickInt== TRUE) {

            RTC_Ioctl(0,RTC_IOC_ENABLE_INT,RTC_TICK_INT,0);

            return E_RTC_SUCCESS;
        }
        break;
    }

    case RTC_IOC_GET_TICK: {
        (*(PUINT32)u32Arg0) = g_u32RTC_Count;
        break;
    }

