Cocoson23/NUC977/Code/Bare Machine/01-GPIOLED/Driver/Source/rtc.c
    case RTC_IOC_RESTORE_TICK: {
        g_u32RTC_Count = 0;
        break;
    }

    case RTC_IOC_ENABLE_INT: {

        switch ((RTC_INT_SOURCE)u32Arg0) {

        case RTC_TICK_INT: {
            g_bIsEnableTickInt   = TRUE;
            u32Tmp = inp32(REG_RTC_INTEN) | RTC_TICK_INT;
            break;
        }
        case RTC_ALARM_INT: {
            g_bIsEnableAlarmInt  = TRUE;

            RTC_WriteEnable(1);
            u32Tmp = inp32(REG_RTC_PWRCTL) | RTC_PWRCTL_ALARM_EN_Msk;

            outp32(REG_RTC_PWRCTL, u32Tmp);
            outp32(REG_RTC_INTEN, inp32(REG_RTC_INTEN) | RTC_INTEN_ALMIEN_Msk);

            RTC_Check();

            u32Tmp = inp32(REG_RTC_INTEN) | RTC_ALARM_INT;

            break;
        }
        case RTC_RELATIVE_ALARM_INT: {
            g_bIsEnableAlarmInt  = TRUE;

            RTC_WriteEnable(1);
            u32Tmp = inp32(REG_RTC_PWRCTL) | RTC_PWRCTL_REL_ALARM_EN_Msk;

            outp32(REG_RTC_PWRCTL, u32Tmp);
            RTC_Check();

            u32Tmp = inp32(REG_RTC_INTEN) | RTC_RELATIVE_ALARM_INT;
            break;
        }
        case RTC_PSWI_INT: {
            g_bIsEnableAlarmInt  = TRUE;
            u32Tmp = inp32(REG_RTC_INTEN) | RTC_PSWI_INT;
            break;
        }
        default: {
            return E_RTC_ERR_ENOTTY;

        }
        }

        RTC_WriteEnable(1);
        outp32(REG_RTC_INTEN, u32Tmp);
        RTC_Check();

        break;
    }
    case RTC_IOC_DISABLE_INT: {

        switch ((RTC_INT_SOURCE)u32Arg0) {
        case RTC_TICK_INT: {
            g_bIsEnableTickInt   = FALSE;

            RTC_WriteEnable(1);
            u32Tmp = inp32(REG_RTC_INTEN) & (~RTC_TICK_INT);

            outp32(REG_RTC_INTEN, u32Tmp);

            outp32(REG_RTC_INTSTS, RTC_TICK_INT);
            RTC_Check();

            break;
        }
        case RTC_ALARM_INT: {
            g_bIsEnableAlarmInt  = FALSE;

            RTC_WriteEnable(1);
            u32Tmp = inp32(REG_RTC_INTEN) & (~RTC_ALARM_INT);

            outp32(REG_RTC_INTEN, u32Tmp);
            RTC_Check();

            RTC_WriteEnable(1);
            u32Tmp = inp32(REG_RTC_PWRCTL) & ~RTC_PWRCTL_ALARM_EN_Msk;

            outp32(REG_RTC_PWRCTL, u32Tmp);
            RTC_Check();

            outp32(REG_RTC_INTSTS, RTC_ALARM_INT);

            break;
        }
        case RTC_RELATIVE_ALARM_INT: {
            g_bIsEnableAlarmInt  = FALSE;

            RTC_WriteEnable(1);
            u32Tmp = inp32(REG_RTC_INTEN) & (~RTC_RELATIVE_ALARM_INT);

            outp32(REG_RTC_INTEN, u32Tmp);
            RTC_Check();

            RTC_WriteEnable(1);
            u32Tmp = inp32(REG_RTC_PWRCTL) & ~RTC_PWRCTL_REL_ALARM_EN_Msk;

            outp32(REG_RTC_PWRCTL, u32Tmp);
            RTC_Check();

            outp32(REG_RTC_INTSTS, RTC_RELATIVE_ALARM_INT);

            break;
        }
        case RTC_PSWI_INT: {
            g_bIsEnableAlarmInt  = FALSE;

            RTC_WriteEnable(1);
            u32Tmp = inp32(REG_RTC_INTEN) & (~RTC_PSWI_INT);

            outp32(REG_RTC_INTEN, u32Tmp);
            RTC_Check();

            outp32(REG_RTC_INTSTS, RTC_PSWI_INT);

            break;
        }

        case RTC_ALL_INT: {
            g_bIsEnableTickInt   = FALSE;
            g_bIsEnableAlarmInt  = FALSE;

            RTC_WriteEnable(1);
            outp32(REG_RTC_INTEN, 0 );
            outp32(REG_RTC_INTSTS, RTC_ALL_INT);
            RTC_Check();

            break;
        }
        default: {
            return E_RTC_ERR_ENOTTY;
        }
        }


        break;
    }

    case RTC_IOC_SET_FREQUENCY: {
        i32Ret= RTC_DoFrequencyCompensation(u32Arg0) ;
        if (i32Ret != 0) {
            return E_RTC_ERR_ENOTTY;
        }
        break;
    }
    case RTC_IOC_SET_POWER_ON: {
        RTC_WriteEnable(1);
        u32Tmp = inp32(REG_RTC_PWRCTL) | 0x01;

        outp32(REG_RTC_PWRCTL,u32Tmp);
        RTC_Check();

        while((inp32(REG_RTC_PWRCTL) & 0x01) != 0x1);

        break;
    }
    case RTC_IOC_SET_POWER_OFF: {
        RTC_WriteEnable(1);
        outp32(REG_RTC_PWRCTL, (inp32(REG_RTC_PWRCTL) & ~0x01) | 2);
        RTC_Check();

        while(1);

        //break;
    }
    case RTC_IOC_SET_POWER_OFF_PERIOD: {
        if(u32Arg0 < 4) u32Arg0 = 4;

        u32Arg0 = u32Arg0 - 4;

        RTC_WriteEnable(1);
        outp32(REG_RTC_PWRCTL, (inp32(REG_RTC_PWRCTL) & ~0xF000) | ((u32Arg0 & 0xF) << 12));
        RTC_Check();

        break;
    }
    case RTC_IOC_ENABLE_HW_POWEROFF: {
        RTC_WriteEnable(1);
        outp32(REG_RTC_PWRCTL, (inp32(REG_RTC_PWRCTL) | 0x04));
        RTC_Check();

        break;
    }
    case RTC_IOC_DISABLE_HW_POWEROFF: {
        RTC_WriteEnable(1);
        outp32(REG_RTC_PWRCTL, (inp32(REG_RTC_PWRCTL) & ~0x04));
        RTC_Check();

        break;
    }
    case RTC_IOC_SET_PSWI_CALLBACK: {

        RTC_Ioctl(0, RTC_IOC_ENABLE_INT, RTC_PSWI_INT, 0);

        if (((PFN_RTC_CALLBACK  *) u32Arg0) != NULL) {
            g_pfnRTCCallBack_PSWI = (PFN_RTC_CALLBACK  *) u32Arg0;
        } else {
            g_pfnRTCCallBack_PSWI = NULL;
        }
        break;
    }
    case RTC_IOC_GET_POWERKEY_STATUS: {
        RTC_WriteEnable(1);
        if(inp32(REG_RTC_PWRCTL) & 0x80)
            *(PUINT32)u32Arg0 = 1;
        else
            *(PUINT32)u32Arg0 = 0;

        break;
    }
    case RTC_IOC_SET_RELEATIVE_ALARM: {
        g_bIsEnableAlarmInt  = TRUE;

        RTC_WriteEnable(1);
        outp32(REG_RTC_PWRCTL,  (inp32(REG_RTC_PWRCTL) & ~0xFFF0010));
        RTC_Check();

        RTC_WriteEnable(1);
        u32Tmp = (inp32(REG_RTC_PWRCTL) & ~0xFFF0000)| ((u32Arg0 & 0xFFF) <<16) | RTC_PWRCTL_REL_ALARM_EN_Msk;

        outp32(REG_RTC_PWRCTL, u32Tmp);
        RTC_Check();

        g_bIsEnableAlarmInt  = TRUE;

        RTC_WriteEnable(1);
        u32Tmp = inp32(REG_RTC_INTEN) | RTC_RELATIVE_ALARM_INT;

        outp32(REG_RTC_INTEN, u32Tmp);
        RTC_Check();

        if(u32Arg1 != 0)
            g_pfnRTCCallBack_Relative_Alarm =   (PFN_RTC_CALLBACK  *)u32Arg1;

        break;

    }

    default: {
        return E_RTC_ERR_ENOTTY;
    }
    }

    return E_RTC_SUCCESS;
}

/**
  * @brief      Disable AIC channel of RTC and both tick and alarm interrupt.
  *
  * @param[in]  None
  *
  * @return     E_RTC_SUCCESS               Success
  *
  */
UINT32 RTC_Close (void)
{

    g_bIsEnableTickInt = FALSE;

    sysDisableInterrupt(RTC_IRQn);


    RTC_Ioctl(0,RTC_IOC_DISABLE_INT,RTC_ALL_INT,0);


    return E_RTC_SUCCESS;
}

/**
  * @brief      Enable RTC clock.
  *
  * @param[in]  bEnable  1: Enable \n
  *                      2: Disable
  *
  * @return     None
  *
  */
void RTC_EnableClock(BOOL bEnable)
{
    if(bEnable)
        outp32(REG_CLK_PCLKEN0, inp32(REG_CLK_PCLKEN0) | (1 << 2));
    else
        outp32(REG_CLK_PCLKEN0, inp32(REG_CLK_PCLKEN0) & ~(1 << 2));

}



/*@}*/ /* end of group NUC970_RTC_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NUC970_RTC_Driver */

/*@}*/ /* end of group NUC970_Device_Driver */


/*** (C) COPYRIGHT 2015 Nuvoton Technology Corp. ***/

